package Base;

import org.testng.annotations.DataProvider;


public class ProductsManagementTestProvider {

    @DataProvider(name = "unitDataProvider")
    public Object[][] unitDataProvider() {
        return new Object[][]{
                {"متر", "Meter", "المنتج يباع بالمتر"},
                {"كيلومتر", "Kilometer", "المنتج يباع بالكيلومتر"},
                {"سنتيمتر", "Centimeter", "المنتج يباع بالسنتيمتر"},
                {"ملم", "Millimeter", "المنتج يباع بالملم"},
                {"إنش", "Inch", "المنتج يباع بالإنش"},
                {"قدم", "Foot", "المنتج يباع بالقدم"},
                {"ياردة", "Yard", "المنتج يباع بالياردة"},
                {"متر مربع", "Square Meter", "المنتج يباع بالمتر المربع"},
                {"لتر", "Liter", "المنتج يباع باللتر"},
                {"غالون", "Gallon", "المنتج يباع بالغالون"},
                {"كيلوجرام", "Kilogram", "المنتج يباع بالكيلوجرام"},
                {"جرام", "Gram", "المنتج يباع بالجرام"},
                {"طن", "Ton", "المنتج يباع بالطن"},
                {"متر مكعب", "Cubic Meter", "المنتج يباع بالمتر المكعب"},
                {"بوصة", "Inch", "المنتج يباع بالبوصة"},
                {"كيلوواط", "Kilowatt", "المنتج يباع بالكيلوواط"},
                {"حصان", "Horsepower", "المنتج يباع بالحصان"},
                {"سنتيمتر مكعب", "Cubic Centimeter", "المنتج يباع بالسنتيمتر المكعب"},
                {"ميل", "Mile", "المنتج يباع بالميل"},
                {"ميكرو متر", "Micrometer", "المنتج يباع بالميكرو متر"}
        };
    }

}